source/_static/diagrams/recipe-read-2.d2
direction: right
n0: "the file"
n1: "it is Python"
n2: "toolchain"
n3: "pin"
n4: "robot"
n0 -> n1
n1 -> n2
n2 -> n3
n3 -> n4
